Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/web-components_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: React and [Web Components](https://developer.mozilla.org/en-US/docs/Web/Web_Components) are built to solve different problems.
ja: React と [Web Components](https://developer.mozilla.org/en-US/docs/Web/Web_Components) は異なる課題を解決する為に構築されました。

source: Web Components provide strong encapsulation for reusable components, while React provides a declarative library that keeps the DOM in sync with your data.
ja: Web Components はコンポーネントをパッケージ化して、高い再利用性を与えます。一方で React は DOM とデータを同期させる為の宣言型のライブラリを提供しています。

source: The two goals are complementary.
ja: この 2 つの目標は互いを補完しあっています。

source: As a developer, you are free to use React in your Web Components, or to use Web Components in React, or both.
ja: あなたは開発者として、Web Components 内で React を使用することも、React 内で Web Components を使用することも、あるいはその両方を行うこともできます。

source: Most people who use React don't use Web Components, but you may want to, especially if you are using third-party UI components that are written using Web Components.
ja: React を使用するほとんどの人は Web Components を使用しませんが、Web Components を用いたサードパーティ製の UI コンポーネントを使用したい時などには活用できるかもしれません。

source: ## Using Web Components in React {#using-web-components-in-react}
ja: ## React で Web Components を使用する {#using-web-components-in-react}

source: > Note: > > Web Components often expose an imperative API.
ja: > 補足: > > Web Components はよく命令型の API を公開しています。

source: For instance, a `video` Web Component might expose `play()` and `pause()` functions.
ja: 例えば、`video` という Web Component が `play()` や `pause()` といった関数を公開しているかもしれません。

source: To access the imperative APIs of a Web Component, you will need to use a ref to interact with the DOM node directly.
ja: Web Component が使う命令型の API にアクセスするには DOM ノードと直接やり取りするために ref を使う必要があります。

source: If you are using third-party Web Components, the best solution is to write a React component that behaves as a wrapper for your Web Component.
ja: サードパーティ製の Web Components を使用している場合は、Web Component のラッパとして機能する React のコンポーネントを作成するのがベストな選択でしょう。

source: > > Events emitted by a Web Component may not properly propagate through a React render tree.
ja: > > Web Component から発された Event は React のレンダーツリーを正しく伝わってこない可能性があります。

source: > You will need to manually attach event handlers to handle these events within your React components.
ja: > React コンポーネント内でイベントに適切に対応するにはそのためのイベントハンドラを与える必要があります。

source: One common confusion is that Web Components use "class" instead of "className".
ja: よくある混乱のひとつとして、Web Components が "className" の代わりに "class" を使用しているケースがあります。

source: ## Using React in your Web Components {#using-react-in-your-web-components}
ja: ## Web Components で React を使用する {#using-react-in-your-web-components}

source: >Note: > >This code **will not** work if you transform classes with Babel.
ja: >補足: > >Babel を使ってクラス変換を行うと上記のコードは**機能しません**。

source: See [this issue](https://github.com/w3c/webcomponents/issues/587) for the discussion.
ja: 詳細や議論は[この issue](https://github.com/w3c/webcomponents/issues/587) を参照してください。

source: >Include the [custom-elements-es5-adapter](https://github.com/webcomponents/polyfills/tree/master/packages/webcomponentsjs#custom-elements-es5-adapterjs) before you load your web components to fix this issue.
ja: >この問題を解決するには [custom-elements-es5-adapter](https://github.com/webcomponents/polyfills/tree/master/packages/webcomponentsjs#custom-elements-es5-adapterjs) をあなたの web component の前に読み込む必要があります。
